backend/test/load-test.yml
config:
  target: 'https://api.pager-system.com'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    # Normal load
    - duration: 300
      arrivalRate: 20
      name: "Normal load"
    # Peak load
    - duration: 120
      arrivalRate: 50
      name: "Peak load"
    # Stress test
    - duration: 60
      arrivalRate: 100
      name: "Stress test"
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  # User authentication flow
  - name: "User Login Flow"
    weight: 30
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "test-user@company.com"
            password: "password123"
          capture:
            json: "$.access_token"
            as: "token"
      - get:
          url: "/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"

  # Incident management flow
  - name: "Incident Management"
    weight: 40
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "test-user@company.com"
            password: "password123"
          capture:
            json: "$.access_token"
            as: "token"
      - post:
          url: "/incidents"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            title: "Load test incident"
            description: "Testing system under load"
            severity: "HIGH"
            service: "API"
          capture:
            json: "$.id"
            as: "incidentId"
      - get:
          url: "/incidents/{{ incidentId }}"
          headers:
            Authorization: "Bearer {{ token }}"
      - put:
          url: "/incidents/{{ incidentId }}"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            status: "ACKNOWLEDGED"

  # Health check
  - name: "Health Check"
    weight: 20
    flow:
      - get:
          url: "/health"

  # On-call rotation
  - name: "On-call Schedule"
    weight: 10
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "test-user@company.com"
            password: "password123"
          capture:
            json: "$.access_token"
            as: "token"
      - get:
          url: "/on-call/current"
          headers:
            Authorization: "Bearer {{ token }}"